Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/ТипыУчетаРабочегоВремени/ТипыУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчетаРабочегоВремени</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>Больничный</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ПричиныНевыходовНаРаботу/ПричиныНевыходовНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныНевыходовНаРаботу</name>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>БезПричины</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/ВидыРабочегоВремени/ВидыРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРабочегоВремени</name>
  <predefined>
    <items>
      <name>ВыходныеДни</name>
      <description>X</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>ВП</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>ВР</description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>ВЧ</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Г</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>ДБ</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>ДО</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>ЗБ</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>К</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>НБ</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>НВ</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>НЗ</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>НН</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>НО</description>
    </items>
    <items>
      <name>Простой</name>
      <description>НП</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>ОВ</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>ОД</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>ОЖ</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>ПВ</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>ПК</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>ПМ</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Р</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>РП</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Т</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>У</description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>УД</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>გ</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>ზგ</description>
    </items>
    <items>
      <name>Другой</name>
      <description>ს</description>
    </items>
    <items>
      <name>Работа</name>
      <description>ს.დ</description>
    </items>
    <items>
      <name>Болезнь</name>
      <description>ს.ფ</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>უხ.შ</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>ღ</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>შ</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/CommonModules/УчетРабочегоВремениСервер/Module.bsl
Процедура СформироватьДокументТабельПоДаннымУчета() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("ПериодРегистрации", НачалоМесяца(ТекущаяДатаСеанса()));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетРабочегоВремениСотрудниковСрезПоследних.Организация КАК Организация,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.ТипУчета КАК ТипУчета,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.ВремяНачала КАК ВремяНачала,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.ВремяОкончания КАК ВремяОкончания,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.КоличествоЧасов КАК КоличествоЧасов,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.Возмещаемый КАК Возмещаемый,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.ПричинаНевыхода КАК ПричинаНевыхода
	|ПОМЕСТИТЬ ВТ_ДанныеУчета
	|ИЗ
	|	РегистрСведений.УчетРабочегоВремениСотрудников.СрезПоследних(, НАЧАЛОПЕРИОДА(ВремяНачала, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)) КАК УчетРабочегоВремениСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//+++ Дмгг Возьмем данные из Регистра сведений
	//|ВЫБРАТЬ
	//|	ГрафикиРаботыПериоды.Ссылка КАК ГрафикРаботы,
	//|	СУММА(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ГрафикиРаботыПериоды.ВремяНачала, ГрафикиРаботыПериоды.ВремяОкончания, МИНУТА) / 60 КАК ЧИСЛО(5, 0))) КАК КоличествоЧасовПоГрафику,
	//|	ГрафикиРаботыПериоды.НомерДня КАК НомерДня
	//|ПОМЕСТИТЬ ВТ_РабочиеЧасыПоГрафику
	//|ИЗ
	//|	Справочник.ГрафикиРаботы.Периоды КАК ГрафикиРаботыПериоды
	//|ГДЕ
	//|	ГрафикиРаботыПериоды.Ссылка В
	//|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|				ВТ_ДанныеУчета.ГрафикРаботы КАК ГрафикРаботы
	//|			ИЗ
	//|				ВТ_ДанныеУчета КАК ВТ_ДанныеУчета)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ГрафикиРаботыПериоды.Ссылка,
	//|	ГрафикиРаботыПериоды.НомерДня
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ГрафикРаботы
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ГрафикиРаботыПериоды.ВремяНачала, ДЕНЬ) ДеньМесяца,
	|	ГрафикиРаботыПериоды.ГрафикРаботы КАК ГрафикРаботы,
	|	СУММА(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ГрафикиРаботыПериоды.ВремяНачала, ГрафикиРаботыПериоды.ВремяОкончания, МИНУТА) / 60 КАК ЧИСЛО(5, 0))) КАК КоличествоЧасовПоГрафику,
	|	ДЕНЬНЕДЕЛИ(ГрафикиРаботыПериоды.ВремяНачала) КАК НомерДня
	|ПОМЕСТИТЬ ВТ_РабочиеЧасыПоГрафику
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботыПериоды
	|ГДЕ
	|	ГрафикиРаботыПериоды.ГрафикРаботы В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеУчета.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеУчета КАК ВТ_ДанныеУчета)
	|	И ГрафикиРаботыПериоды.ВремяНачала >= НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И ГрафикиРаботыПериоды.ВремяОкончания <= КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ГрафикиРаботыПериоды.ВремяНачала, ДЕНЬ),
	|	ГрафикиРаботыПериоды.ГрафикРаботы,
	|	ДЕНЬНЕДЕЛИ(ГрафикиРаботыПериоды.ВремяНачала)
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Организация КАК Организация,
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеСотрудников
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			,
	|			(Организация, Сотрудник) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ДанныеУчета.Организация КАК Организация,
	|					ВТ_ДанныеУчета.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_ДанныеУчета КАК ВТ_ДанныеУчета)) КАК СотрудникиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	СтруктурнаяЕдиница,
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеУчета.Организация КАК Организация,
	|	ВТ_ДанныеУчета.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_ДанныеУчета.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеУчета.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ДанныеУчета.ТипУчета КАК ТипУчета,
	|	ВТ_ДанныеУчета.ВремяНачала КАК ВремяНачала,
	|	ВТ_ДанныеУчета.ВремяОкончания КАК ВремяОкончания,
	|	ВТ_ДанныеУчета.КоличествоЧасов КАК КоличествоЧасов,
	|	ВТ_ДанныеУчета.Возмещаемый КАК Возмещаемый,
	|	ВТ_ДанныеУчета.ПричинаНевыхода КАК ПричинаНевыхода,
	|	ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику КАК КоличествоЧасовПоГрафику,
	|	ДЕНЬ(ВТ_ДанныеУчета.ВремяНачала) КАК День,
	|	ВТ_ДанныеСотрудников.Должность КАК Должность,
	|	НАЧАЛОПЕРИОДА(ВТ_ДанныеУчета.ВремяНачала, МЕСЯЦ) КАК ПериодРегистрации
	|ИЗ
	|	ВТ_ДанныеУчета КАК ВТ_ДанныеУчета
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|		ПО (ИСТИНА)
	|			И ВТ_ДанныеУчета.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	//|			И (ДЕНЬНЕДЕЛИ(ВТ_ДанныеУчета.ВремяНачала) = ВТ_РабочиеЧасыПоГрафику.НомерДня)
	|			И (НАЧАЛОПЕРИОДА(ВТ_ДанныеУчета.ВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТ_РабочиеЧасыПоГрафику.ДеньМесяца, ДЕНЬ))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|		ПО (ИСТИНА)
	|			И ВТ_ДанныеУчета.Организация = ВТ_ДанныеСотрудников.Организация
	|			И ВТ_ДанныеУчета.СтруктурнаяЕдиница = ВТ_ДанныеСотрудников.СтруктурнаяЕдиница
	|			И ВТ_ДанныеУчета.Сотрудник = ВТ_ДанныеСотрудников.Сотрудник
	|			И ВТ_ДанныеУчета.ГрафикРаботы = ВТ_ДанныеСотрудников.ГрафикРаботы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	День
	|ИТОГИ
	|	МИНИМУМ(ВремяНачала)
	|ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	ПериодРегистрации,
	|	День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Табель.Ссылка КАК Ссылка,
	|	Табель.Организация КАК Организация,
	|	Табель.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Табель.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	Документ.Табель КАК Табель
	|ГДЕ
	|	НЕ Табель.ПометкаУдаления
	|	И (Табель.Организация, Табель.СтруктурнаяЕдиница, Табель.ПериодРегистрации) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеУчета.Организация КАК Организация,
	|				ВТ_ДанныеУчета.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|				НАЧАЛОПЕРИОДА(ВТ_ДанныеУчета.ВремяНачала, МЕСЯЦ) КАК Поле1
	|			ИЗ
	|				ВТ_ДанныеУчета КАК ВТ_ДанныеУчета)";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаОрганизация = РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаДокументовТабель = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	ТаблицаДокументовТабель.Индексы.Добавить("Организация, СтруктурнаяЕдиница, ПериодРегистрации");
	СтруктураПоиска = Новый Структура("Организация, СтруктурнаяЕдиница, ПериодРегистрации"); 
	СтруктураПоискаСотрудник = Новый Структура("Сотрудник, Должность"); 
	
	Пока ВыборкаОрганизация.Следующий() Цикл
	
		ВыборкаСтруктурнаяЕдиница = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтруктурнаяЕдиница.Следующий() Цикл
		
			ВыборкаПериодРегистрации = ВыборкаСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПериодРегистрации.Следующий() Цикл
			
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПериодРегистрации); 
				СтрокиТабель = ТаблицаДокументовТабель.НайтиСтроки(СтруктураПоиска);
				ТабельСуществует = Ложь;
				Если СтрокиТабель.Количество() Тогда
				
					ДокументТабель = СтрокиТабель[0].Ссылка.ПолучитьОбъект();
					ТабельСуществует = Истина;
				
				Иначе
				
					ДокументТабель = Документы.Табель.СоздатьДокумент();
					ЗаполнитьЗначенияСвойств(ДокументТабель, ВыборкаПериодРегистрации); 
					ДокументТабель.Дата = КонецМесяца(ВыборкаПериодРегистрации.ПериодРегистрации);
				
				КонецЕсли;
				
				//ДокументТабель.ОтработанноеВремяПоДням.Очистить();
				ДокументТабель.ОтработанноеВремяЗаПериод.Очистить();
				ДокументТабель.СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ПоДням;
				
				ВыборкаДень = ВыборкаПериодРегистрации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДень.Следующий() Цикл
				
					Выборка = ВыборкаДень.Выбрать();
					ТекущийСотрудник = Неопределено;
					НомерВидаВремени = 0; 
					ОчиститьДанныеДня(ДокументТабель, ВыборкаДень.День);
					Пока Выборка.Следующий() Цикл
						
						Если ТекущийСотрудник <> Выборка.Сотрудник Тогда
							
							ЗаполнитьЗначенияСвойств(СтруктураПоискаСотрудник, Выборка);
							СтрокиСотрудник = ДокументТабель.ОтработанноеВремяПоДням.НайтиСтроки(СтруктураПоискаСотрудник);
							Если СтрокиСотрудник.Количество() Тогда
							
								СтрокаТабеля = СтрокиСотрудник[0];	
							
							Иначе
							
								СтрокаТабеля = ДокументТабель.ОтработанноеВремяПоДням.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТабеля, Выборка);
							
							КонецЕсли; 
							НомерВидаВремени = 0;
							
						КонецЕсли;
						НомерВидаВремени = НомерВидаВремени + 1;
						СтруктураКолонок = ПолучитьИменаКолонокПоНомеруВидаВремени(НомерВидаВремени);
						ТекущийСотрудник = Выборка.Сотрудник;
						СтрокаТабеля[СтруктураКолонок.ВидВремени + Формат(Выборка.День, "ЧДЦ=0; ЧГ=0")] = ПолучитьВидРабочегоВремени(Выборка);
						СтрокаТабеля[СтруктураКолонок.Часы + Формат(Выборка.День, "ЧДЦ=0; ЧГ=0")] = Мин(Выборка.КоличествоЧасовПоГрафику, Выборка.КоличествоЧасов);
						Если Выборка.ТипУчета = Перечисления.ТипыУчетаРабочегоВремени.Работа
							И Выборка.КоличествоЧасов > Выборка.КоличествоЧасовПоГрафику
							//+++ Дмгг
							ИЛИ (Выборка.ТипУчета = Перечисления.ТипыУчетаРабочегоВремени.ПустаяСсылка()
									И Выборка.КоличествоЧасов <> 0)
							//--- Дмгг
							Тогда
							
							НомерВидаВремени = НомерВидаВремени + 1;
							СтруктураКолонок = ПолучитьИменаКолонокПоНомеруВидаВремени(НомерВидаВремени);
							СтрокаТабеля[СтруктураКолонок.ВидВремени + Формат(Выборка.День, "ЧДЦ=0; ЧГ=0")] = Справочники.ВидыРабочегоВремени.Сверхурочные;
							СтрокаТабеля[СтруктураКолонок.Часы + Формат(Выборка.День, "ЧДЦ=0; ЧГ=0")] = Выборка.КоличествоЧасов - Выборка.КоличествоЧасовПоГрафику;
							
						КонецЕсли; 
						
					КонецЦикла; 
				
				КонецЦикла; 
				
				ДокументТабель.Записать(РежимЗаписиДокумента.Проведение);
			
			КонецЦикла; 
		
		КонецЦикла; 
	
	КонецЦикла; 	

КонецПроцедуры

Процедура ОчиститьДанныеДня(Табель, НомерДня)

	Для каждого ТекСтрока Из Табель.ОтработанноеВремяПоДням Цикл
	
		ТекСтрока["ПервыйВидВремени" + НомерДня] = Неопределено;	
		ТекСтрока["ВторойВидВремени" + НомерДня] = Неопределено;	
		ТекСтрока["ТретийВидВремени" + НомерДня] = Неопределено;	
		ТекСтрока["ПервыйЧасы" + НомерДня] = 0;	
		ТекСтрока["ВторойЧасы" + НомерДня] = 0;	
		ТекСтрока["ТретийЧасы" + НомерДня] = 0;	
	
	КонецЦикла; 	

КонецПроцедуры

Функция ПолучитьИменаКолонокПоНомеруВидаВремени(НомерВидаВремени)

	Если НомерВидаВремени = 1 Тогда
		
		Нумератор = "Первый";
	
	ИначеЕсли НомерВидаВремени = 2 Тогда
	
		Нумератор = "Второй";
		
	ИначеЕсли НомерВидаВремени = 3 Тогда
	
		Нумератор = "Третий";
	
	КонецЕсли;
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("ВидВремени", Нумератор + "ВидВремени");
	СтруктураКолонок.Вставить("Часы", Нумератор + "Часы");
	Возврат СтруктураКолонок;

КонецФункции // ПолучитьИменаКолонокПоНомеруВидаВремени()
 

Функция ПолучитьВидРабочегоВремени(Выборка)

	Если Выборка.ТипУчета = Перечисления.ТипыУчетаРабочегоВремени.Работа Тогда
	
		Возврат Справочники.ВидыРабочегоВремени.Работа;	
		
	ИначеЕсли Выборка.ТипУчета = Перечисления.ТипыУчетаРабочегоВремени.Отпуск
		И Выборка.ПричинаНевыхода = Перечисления.ПричиныНевыходовНаРаботу.Отпуск
		Тогда
	
		Возврат Справочники.ВидыРабочегоВремени.ОсновнойОтпуск;	
	
	ИначеЕсли Выборка.ТипУчета = Перечисления.ТипыУчетаРабочегоВремени.Работа
		И Выборка.ПричинаНевыхода = Перечисления.ПричиныНевыходовНаРаботу.Отгул
		И Выборка.Возмещаемый
		Тогда
	
		Возврат Справочники.ВидыРабочегоВремени.ОсновнойОтпуск;	
	
	ИначеЕсли Выборка.ТипУчета = Перечисления.ТипыУчетаРабочегоВремени.Работа
		И Выборка.ПричинаНевыхода = Перечисления.ПричиныНевыходовНаРаботу.Отгул
		И НЕ Выборка.Возмещаемый
		Тогда
	
		Возврат Справочники.ВидыРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству;	
	
	ИначеЕсли Выборка.ТипУчета = Перечисления.ТипыУчетаРабочегоВремени.Больничный
		И Выборка.ПричинаНевыхода = Перечисления.ПричиныНевыходовНаРаботу.Болезнь
		Тогда
	
		Возврат Справочники.ВидыРабочегоВремени.Болезнь;	
	
	ИначеЕсли Выборка.ПричинаНевыхода = Перечисления.ПричиныНевыходовНаРаботу.БезПричины
		Тогда
	
		Возврат Справочники.ВидыРабочегоВремени.Прогулы;	
	
	Иначе
	
		Возврат Справочники.ВидыРабочегоВремени.Другой;	
	
	КонецЕсли; 	

КонецФункции // ПолучитьВидРабочегоВремени()

Процедура ВыполнитьЗагрузкуДанныхНаСервере()

	Перем ПутьКФайлу;
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиОбменаХЗ = Константы.НастройкиОбменаСДаннымиОПосещенииСотрудников.Получить();
	Если НастройкиОбменаХЗ <> Неопределено Тогда
	
		НастройкиОбмена = НастройкиОбменаХЗ.Получить();
		Если ТипЗнч(НастройкиОбмена) = Тип("Структура")
			И НастройкиОбмена.Свойство("ПутьКФайлу", ПутьКФайлу)
			Тогда
			
			Файл = Новый Файл(ПутьКФайлу);
			Если Не Файл.Существует() Тогда
			  
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='Файл ';ru='Файл ';en='Файл '") + ПутьКФайлу + НСтр("ka=' не найден';ru=' не найден';en=' не найден'");
				Сообщение.Сообщить(); 
				Возврат;
			
			КонецЕсли;
			
			ТабДок = Новый ТабличныйДокумент;
			ТабДок.Прочитать(ПутьКФайлу);
			НаборЗаписей = РегистрыСведений.ПриходыУходыСотрудников.СоздатьНаборЗаписей();
			Период = ТекущаяДатаСеанса();
			ТаблицаЗагрузки = НаборЗаписей.ВыгрузитьКолонки();
			
			Для Сч = 2 По ТабДок.ВысотаТаблицы Цикл
			
				СтрокаТаблицы = ТаблицаЗагрузки.Добавить();
				ДатаИзДокумента = СокрЛП(ТабДок.Область(Сч, 5, Сч, 5).Текст);
				День = Сред(ДатаИзДокумента,1,2);
				Месяц = Сред(ДатаИзДокумента,4,2);
				Год = Сред(ДатаИзДокумента,7,4);
				Час = Сред(ДатаИзДокумента,12,2);
				Минуты = Сред(ДатаИзДокумента,15,2);
				Секунды = Сред(ДатаИзДокумента,18,2);
				
				ДатаДляЗагрузки = Дата(Год,Месяц,День,Час,Минуты,Секунды);
				СтрокаТаблицы.Дата = ДатаДляЗагрузки;//СокрЛП(ТабДок.Область(Сч, 5, Сч, 5).Текст);
				СтрокаТаблицы.DeviceId = СокрЛП(ТабДок.Область(Сч, 1, Сч, 1).Текст);
				СтрокаТаблицы.PersonId = СокрЛП(ТабДок.Область(Сч, 2, Сч, 2).Текст);
				
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТаблицаЗагрузки", ТаблицаЗагрузки);
			Запрос.УстановитьПараметр("Период", Период);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаЗагрузки.Дата КАК Дата,
			|	ТаблицаЗагрузки.DeviceId КАК DeviceId,
			|	ТаблицаЗагрузки.PersonId КАК PersonId
			|ПОМЕСТИТЬ ВТ_ТаблицаЗагрузки
			|ИЗ
			|	&ТаблицаЗагрузки КАК ТаблицаЗагрузки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	PersonId
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПриходыУходыСотрудников.Дата КАК Дата,
			|	ПриходыУходыСотрудников.Сотрудник.PersonId КАК PersonId
			|ПОМЕСТИТЬ ВТ_ЗаписиРегистра
			|ИЗ
			|	РегистрСведений.ПриходыУходыСотрудников КАК ПриходыУходыСотрудников
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	PersonId,
			|	Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Период КАК ДатаЗагрузки,
			|	Сотрудники.Ссылка КАК Сотрудник,
			|	ВТ_ТаблицаЗагрузки.Дата КАК Дата,
			|	ВТ_ТаблицаЗагрузки.DeviceId КАК DeviceId,
			|	ВТ_ТаблицаЗагрузки.PersonId КАК PersonId
			|ИЗ
			|	ВТ_ТаблицаЗагрузки КАК ВТ_ТаблицаЗагрузки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО ВТ_ТаблицаЗагрузки.PersonId = Сотрудники.PersonId
			|ГДЕ
			|	ВТ_ТаблицаЗагрузки.PersonId > 0
			|	И НЕ (ВТ_ТаблицаЗагрузки.PersonId, ВТ_ТаблицаЗагрузки.Дата) В
			|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|					ВТ_ЗаписиРегистра.PersonId КАК PersonId,
			|					ВТ_ЗаписиРегистра.Дата КАК Дата
			|				ИЗ
			|					ВТ_ЗаписиРегистра КАК ВТ_ЗаписиРегистра)";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
					МенеджерЗаписи = РегистрыСведений.ПриходыУходыСотрудников.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка); 
					МенеджерЗаписи.Записать();
			
			КонецЦикла; 
			
		КонецЕсли; 
	
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	

КонецПроцедуры // ВыполнитьЗагрузкуДанныхНаСервере()


Процедура ПолучениеДанныхУчетаРабочегоВремени() Экспорт
	
	ВыполнитьЗагрузкуДанныхНаСервере();
	СформироватьДокументУчетРабочегоВремени();
	СформироватьДокументТабельПоДаннымУчета();
	
КонецПроцедуры

Процедура СформироватьДокументУчетРабочегоВремени()

	Перем  Организация;
	УстановитьПривилегированныйРежим(Истина);
	ХЗНастройкиОбмена = Константы.НастройкиОбменаСДаннымиОПосещенииСотрудников.Получить();
	Если ХЗНастройкиОбмена <> Неопределено И ТипЗнч(ХЗНастройкиОбмена) = Тип("ХранилищеЗначения") Тогда
	
		НастройкиОбмена = ХЗНастройкиОбмена.Получить();
		Если НастройкиОбмена.Свойство("Организация", Организация)
			И ЗначениеЗаполнено(Организация)
			Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УчетРабочегоВремениСотрудников.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.УчетРабочегоВремениСотрудников КАК УчетРабочегоВремениСотрудников
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(УчетРабочегоВремениСотрудников.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
			|	И НЕ УчетРабочегоВремениСотрудников.ПометкаУдаления
			|	И УчетРабочегоВремениСотрудников.Организация = &Организация";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
		    Если Выборка.Следующий() Тогда
			
				ДокументУчетРВ = Выборка.Ссылка.ПолучитьОбъект();
			
			Иначе
				
				ДокументУчетРВ = Документы.УчетРабочегоВремениСотрудников.СоздатьДокумент();
				
			КонецЕсли; 
			ДокументУчетРВ.Дата = КонецДня(ТекущаяДатаСеанса());
			ДокументУчетРВ.Организация = Организация;
			ДокументУчетРВ.ЗаполнитьПоДаннымУчета();
			ДокументУчетРВ.Записать(РежимЗаписиДокумента.Проведение);
		
		КонецЕсли;	
	
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
